OpenNuvoton/M2351BSP/SampleCode/StdDriver/I2C_PDMA_TRx/main.c
}

void I2C_PDMA(void)
{
    uint8_t i;
    uint32_t u32TimeOutCnt;

    for (i = 0; i < PDMA_TEST_LENGTH; i++)
    {
        s_au8MasterTxBuffer[i] = i;
        s_au8SlaveRxBuffer[i] = 0xff;
    }

    s_au8MasterTxBuffer[0] = (uint8_t)((s_u8DeviceAddr << 1) | 0x00);   /* 1 byte SLV + W */
    s_au8MasterTxBuffer[1] = 0x00;                             /* 2 bytes Data address */
    s_au8MasterTxBuffer[2] = 0x00;

    PDMA_Init();

    /* I2C enter no address SLV mode */
    I2C_SET_CONTROL_REG(I2C1, I2C_CTL_SI | I2C_CTL_AA);
    /* Enable I2C1 PDMA RX mode */
    I2C1->CTL1 = I2C_CTL1_RXPDMAEN_Msk;

    /* I2C1 function to Slave receive data */
    s_I2C1HandlerFn = I2C_PDMA_SlaveRx;

    s_u32PDMADoneFlag = 0;

    /* Enable I2C TX */
    I2C0->CTL1 = I2C_CTL1_TXPDMAEN_Msk;

    s_I2C0HandlerFn = (I2C_FUNC)I2C_PDMA_MasterTx;

    /* Send START condition, start the PDMA data transmit */
    I2C_START(I2C0);

    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */
    while (!s_u32PDMADoneFlag)
    {
        if(--u32TimeOutCnt == 0)
        {
            printf("Wait for PDMA transfer done time-out!\n");
            return;
        }
    }

    /* Disable I2C0 PDMA TX mode */
    I2C0->CTL1 &= ~I2C_CTL1_TXPDMAEN_Msk;
    /* Disable I2C1 PDMA RX mode */
    I2C1->CTL1 &= ~I2C_CTL1_RXPDMAEN_Msk;

    for (i = 0; i < PDMA_TEST_LENGTH; i++)
    {
        if (s_au8SlaveRxBuffer[i] != s_au8MasterTxBuffer[i])
        {
            printf("\n Slave Receive Data Compare Error !!");
            return;
        }
        else
        {
            if(i > 2)
                s_au8SlaveTxBuffer[i-3] = s_au8MasterTxBuffer[i];
        }
    }

    /* Test Master RX and Slave TX with PDMA function */

    /* I2C0 function to Master receive data */
    s_I2C0HandlerFn = (I2C_FUNC)I2C_PDMA_MasterRx;
    /* I2C1 function to Slave transmit data */
    s_I2C1HandlerFn = I2C_PDMA_SlaveTx;

    s_u32PDMADoneFlag = 0;

    /* Send START condition */
    I2C_START(I2C0);

    u32TimeOutCnt = SystemCoreClock; /* 1 second time-out */
    while (!s_u32PDMADoneFlag)
    {
        if(--u32TimeOutCnt == 0)
        {
            printf("Wait for PDMA transfer done time-out!\n");
            return;
        }
    }

    I2C_STOP(I2C0);
    /* Disable I2C0 PDMA RX mode */
    I2C0->CTL1 &= ~I2C_CTL1_RXPDMAEN_Msk;
    /* Disable I2C1 PDMA TX mode */
    I2C1->CTL1 &= ~I2C_CTL1_TXPDMAEN_Msk;

    for (i = 0; i < PDMA_TEST_LENGTH - 3; i++)
    {
        if (s_au8MasterRxBuffer[i] != s_au8MasterTxBuffer[i+3])
        {
            printf("\n Slave Receive Data Compare Error !!");

            return;
        }
    }

    printf("\nI2C PDMA test Pass.\n");
}

/*---------------------------------------------------------------------------------------------------------*/
/*  Main Function                                                                                          */
/*---------------------------------------------------------------------------------------------------------*/
int32_t main(void)
{
    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Init System, IP clock and multi-function I/O */
    SYS_Init();

    /* Init UART0 for printf */
    UART0_Init();

    /* Lock protected registers */
    SYS_LockReg();

    /*
        This sample code sets I2C bus clock to 100kHz. Then, Master accesses Slave with Byte Write
        and Byte Read operations, and check if the read data is equal to the programmed data.
    */

    printf("+-------------------------------------------------------+\n");
    printf("| I2C Driver Sample Code for PDMA                       |\n");
    printf("|                                                       |\n");
    printf("| I2C Master (I2C0) <---> I2C Slave(I2C1)               |\n");
    printf("+-------------------------------------------------------+\n");

    printf("\n");
    printf("Configure I2C0 as Master, and I2C1 as a Slave.\n");
    printf("The I/O connection I2C0 to I2C1:\n");
    printf("I2C0_SDA(PA.4), I2C0_SCL(PA.5)\n");
    printf("I2C1_SDA(PA.2), I2C1_SCL(PA.3)\n\n");

    /* Init I2C0 */
    I2C0_Init();
    /* Init I2C1 */
    I2C1_Init();

    I2C_PDMA();

    while (1);
}
